"use strict";

const BLOCKSIZE = 20;
const TEXT = {
    retry: "もう一度Rでリトライ",
    stageClear: "STAGE CLEAR !!",
    clearEX: "Spaceで次のステージ",
    lastStage: "現在こちらが最後のステージです",
    lastStage2: "プレイありがとうございました",
};
const CHARA = {
    " ": ["color", "#aaa", 16], // 16: 背景
    "#": ["color", "#622", 1 + 16], // 1: 壁
    "S": ["letter", "😎", 0],
    ".": ["color", "#48c", 2 + 16], // 2: ゴール
    "P": ["letter", "🥺", 1 + 4 + 8], // 4: 押せるentity, 8:クリア判定あり
    "p": ["letter", "🥺", 1 + 4 + 8 + 2], // 4: 押せるentity, 8:クリア判定あり
    "U": ["letter", "💩", 1 + 32], // 32: うんち
    "u": ["letter", "💩", 1 + 32 + 2], // 32: うんち
    "Y": ["letter", "🤥", 1 + 4 + 8 + 64], // 64: うんち食べる
    "y": ["letter", "🤥", 1 + 4 + 8 + 64 + 2], // 64: うんち食べる
};

const STAGE = [
    [
        [
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "      #########     ",
            "      #.    PS#     ",
            "      #########     ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
        ],
        [],
    ],
    [
        [
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "       ######       ",
            "       #.  ##       ",
            "       #  P #       ",
            "       ##  S#       ",
            "       ######       ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
        ],
        [
            "👨‍🌾「このぷゆゆは寝床が分からないらしいので",
            "　　 連れて行ってあげてください」",
            "😎「なんで分かんねえんだよ💢」",
            "🥺「❓」",
        ],
    ],
    [
        [
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "       ######       ",
            "       #.   #       ",
            "       #pPPS#       ",
            "       #.   #       ",
            "       ######       ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
        ],
        ["🥺「ぷー」🥺「ぷー」🥺「ぷー」", "😎「はやく寝ろ」"],
    ],
    [
        [
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "       #######      ",
            "       #.#   #      ",
            "       #.# P #      ",
            "       #  SP##      ",
            "       #  # #       ",
            "       ##   #       ",
            "        #####       ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
        ],
        ["🥺「道に迷っちゃったぷゆ……」", "😎（なんで迷うんだ……？）"],
    ],
    [
        [
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "        #####       ",
            "       ##   #       ",
            "       #  # #       ",
            "       #  u ##      ",
            "       #  pY #      ",
            "       ##   S#      ",
            "        ######      ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
        ],
        ["🥺「うんちがあって眠れないぷゆ！」", "🤥「ゆめちゃんの食事邪魔するのやめてな」"],
    ],
    [
        [
            "                    ",
            "                    ",
            "                    ",
            "                    ",
            "      #######       ",
            "      #  #  #       ",
            "      # YYU #       ",
            "      # .Y. #       ",
            "      ## #  #       ",
            "      # .  S#       ",
            "      #######       ",
            "                    ",
            "                    ",
            "                    ",
            "                    ",
        ],
        [
            "🤥「ゆめちゃんうんち食べるよぉ🤥💩」",
            "🤥「なりすまし🤥💢",
            "　　 ゆめちゃんいちご食べるよぉ🤥🍓」",
            "🤥「おまなり🤥💢」",
            "😎「はよ寝ろ💢」",
        ],
    ],
];
